src/cf/Documents/уатПровеска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПровеска</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПровески</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПровески</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НатурныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатНатурныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатНакладнаяГУ27</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемосдатчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вагоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вагон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГруза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
								<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеттоРасчетное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатНатурныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНатурныйЛист</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловаХвост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Живность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексНегабаритности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрикрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяДлина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вагоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВагона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСобственника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаГруза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтанцияНазначенияВагона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГруза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеОтметки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКонтейнеров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыходнаяПограничнаяСтанция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТараВагона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Больной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фронт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатГрузовыеФронты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПровеска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатПровеска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатПровеска";
	КомандаПечати.Идентификатор = "АктПеревески";
	КомандаПечати.Представление = НСтр("ru = 'Акт перевески'; en = 'Reweighing Act'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПеревески") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПеревески",
			"Акт перевески", ПечатьАктПеревески(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПровеска.ДатаПровески КАК Период,
	|	уатПровеска.ДатаОкончанияПровески КАК ДатаОкончания,
	|	уатПровескаВагоны.Вагон КАК ТС,
	|	МИНИМУМ(ЗНАЧЕНИЕ(Справочник.уатСостояниеТС.Провешен)) КАК Состояние,
	|	уатПровескаВагоны.Заказ КАК Заказ
	|ИЗ
	|	Документ.уатПровеска КАК уатПровеска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПО уатПровеска.Ссылка = уатПровескаВагоны.Ссылка
	|ГДЕ
	|	уатПровеска.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПровеска.ДатаПровески,
	|	уатПровеска.ДатаОкончанияПровески,
	|	уатПровескаВагоны.Вагон,
	|	уатПровескаВагоны.Заказ";
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", ТаблицаДокумента);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

#Область Печать

Функция ПечатьАктПеревески(МассивОбъектов, ОбъектыПечати, ПараметрыПечати=Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктПеревески";
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	СсылкаНаОбъект = МассивОбъектов[0].Ссылка;
	
	ПровескаСсылка     = Документы.уатПровеска.ПустаяСсылка();
	НатурныйЛистСсылка = Документы.уатНатурныйЛист.ПустаяСсылка();
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.уатНатурныйЛист") Тогда
		НатурныйЛистСсылка = СсылкаНаОбъект;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уатПровеска.Ссылка КАК ПровескаСсылка
		|ИЗ
		|	Документ.уатПровеска КАК уатПровеска
		|ГДЕ
		|	уатПровеска.НатурныйЛист = &НатурныйЛист
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатПровеска.Дата УБЫВ";
		Запрос.УстановитьПараметр("НатурныйЛист", НатурныйЛистСсылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Количество() > 1 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'С данным натурным листом связаны несколько провесок, взята старшая по дате'; en = 'Several hangers are associated with this natural sheet, the oldest one by date is taken'"));
			КонецЕсли;
			Выборка.Следующий();
			ПерваяСтрока = Выборка;
			ПровескаСсылка = ПерваяСтрока.ПровескаСсылка;
		КонецЕсли;
	Иначе
		ПровескаСсылка = СсылкаНаОбъект;
		Если ЗначениеЗаполнено(ПровескаСсылка.НатурныйЛист) Тогда
			НатурныйЛистСсылка = ПровескаСсылка.НатурныйЛист;
		КонецЕсли;
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПровеска.АктПеревески");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	Заголовок = НСтр("ru = 'Акт перевески №%1 от %2'; en = 'Reweighing Act No.%1 from %2'");
	Заголовок = СтрЗаменить(Заголовок, "%1", ПровескаСсылка.Номер);
	Заголовок = СтрЗаменить(Заголовок, "%2", Формат(ПровескаСсылка.Дата,"ДФ='dd MMMM yyyy ""г.""'"));
	
	Период = ПровескаСсылка.Дата;
	
	ОбластьМакета.Параметры.ТекстЗаголовка = Заголовок;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Станции");
	
	ОбластьМакета.Параметры.СтанцияОтправления = НатурныйЛистСсылка.СтанцияОтправления;
	ОбластьМакета.Параметры.СтанцияНазначения = НатурныйЛистСсылка.СтанцияНазначения;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Отправитель");
	
	НаименованиеОрагнизации = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ПровескаСсылка.Организация),
		"НаименованиеДляПечатныхФорм");
	ОбластьМакета.Параметры.Отправитель = НаименованиеОрагнизации;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Накладная");
	
	ОбластьМакета.Параметры.Накладная = ПровескаСсылка.Накладная;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(НатурныйЛистСсылка) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НатурныйЛист");
		
		ОбластьМакета.Параметры.НатурныйЛист = НатурныйЛистСсылка;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(уатПровескаВагоны.Вагон, уатНатурныйЛистВагоны.НомерВагона) КАК Вагон,
	|	ЕСТЬNULL(уатПровескаВагоны.Вагон.Грузоподъемность, уатНатурныйЛистВагоны.НомерВагона.Грузоподъемность) КАК Грузоподъемность,
	|	уатПровескаВагоны.Груз КАК Груз,
	|	ЕСТЬNULL(уатПровескаВагоны.Брутто, 0) КАК БруттоПоПеревеске,
	|	ЕСТЬNULL(уатПровескаВагоны.Нетто, 0) КАК НеттоПоПеревеске,
	|	ЕСТЬNULL(уатПровескаВагоны.Тара, 0) КАК ТараПоПеревеске,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.МассаГруза, 0) КАК БруттоПоДокументам,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.МассаГруза, 0) - ЕСТЬNULL(уатНатурныйЛистВагоны.ТараВагона, 0) КАК НеттоПоДокументам,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.ТараВагона, 0) КАК ТараПоДокументам,
	|	уатНатурныйЛистВагоны.КодПолучателя КАК Получатель
	|ИЗ
	|	Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уатНатурныйЛист.Вагоны КАК уатНатурныйЛистВагоны
	|		ПО уатПровескаВагоны.Вагон = уатНатурныйЛистВагоны.НомерВагона
	|			И уатПровескаВагоны.КодГруза = уатНатурныйЛистВагоны.КодГруза
	|ГДЕ
	|	уатНатурныйЛистВагоны.Ссылка = &НатурныйЛистСсылка
	|	И уатПровескаВагоны.Ссылка = &ПровескаСсылка";
	
	Запрос.УстановитьПараметр("НатурныйЛистСсылка", НатурныйЛистСсылка);
	Запрос.УстановитьПараметр("ПровескаСсылка", ПровескаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
		
		РазницаНетто = Выборка.НеттоПоПеревеске - Выборка.НеттоПоДокументам;
		ЗнакЧисла = "";
		Если РазницаНетто > 0 Тогда
			ЗнакЧисла = "+";
		КонецЕсли;
		РазницаНетто = ЗнакЧисла + Строка(РазницаНетто);
		
		ОбластьМакета.Параметры.РазницаНетто = РазницаНетто;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.ФИОПриемосдатчика = ПровескаСсылка.Приемосдатчик;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
